doneadd = "🇸🇦│تم تفعيل المجموعة ([{}])"

doneadd2 = "🇸🇦│تم تفعيل المجموعة ([{}])"

doneadded = "🇸🇦│المجموعة ([{}]) مفعلة"

disabled = "🇸🇦│المجموعة ([{}]) معطلة"

disabl = "🇸🇦│تم تعطيل المجموعة ([{}])"


userNocc = "🇸🇦│عذراً لايمكنني الوصول الى (الايدي|المعرف)"

locked = """🇸🇦│بواسطة ↫ {} 
🇸🇦│{} بالفعل مقفوله في المجموعة"""
lock = """🇸🇦│بواسطة ↫ {} 
🇸🇦│تم قفل {} في المجموعة"""

unlocked = """🇸🇦│بواسطة ↫ {} 
🇸🇦│{} بالفعل مفتوحه في المجموعة"""
unlock = """🇸🇦│بواسطة ↫ {} 
🇸🇦│تم فتح {} في المجموعة"""
kickbotadd = "تم طرد البوت <a href='http://t.me/{}'>{}</a>"

ADDed = """🇸🇦│بواسطة ↫ {} 
🇸🇦│{} بالفعل مفعله في المجموعة"""
ADD = """🇸🇦│بواسطة ↫ {} 
🇸🇦│تم تفعيل {} في المجموعة"""

unADDed = """🇸🇦│بواسطة ↫ {} 
🇸🇦│{} بالفعل معطله في المجموعة"""
unADD = """🇸🇦│بواسطة ↫ {} 
🇸🇦│تم تعطيل {} في المجموعة"""

true = "√"

false = "✘"

settings = """🇸🇦│اعدادات المجموعة
🇸🇦│√←مفتوحه | ✘←مقفوله"""

st2 = """🇸🇦│اعدادات المجموعة
🇸🇦│√←مفعله | ✘←معطله
🇸🇦│وقت التكرار : (<b>{}</b>)
🇸🇦│عدد التكرار : (<b>{}</b>)"""



notforyou = "🇸🇦│عذراً الامر ليس لك"

Corder = "🇸🇦│الغاء الامر"

doneCO = "🇸🇦│تم الغاء الامر"
ARdoneCO = "🇸🇦│بالفعل تم الغاء الامر"

setRK = """🇸🇦│العضو : {}
🇸🇦│تم رفعه {}"""
remRK = """🇸🇦│العضو : {}
🇸🇦│تم تنزيله من ال{}"""

DsetRK = """🇸🇦│العضو : {}
🇸🇦│بالفعل {}"""
DremRK = """🇸🇦│العضو : {}
🇸🇦│ليس {}"""

ban = """🇸🇦│العضو : {}
🇸🇦│تم حظره من المجموعة"""
Dban = """🇸🇦│العضو : {}
🇸🇦│بالفعل محظور من المجموعة"""

banall = """🇸🇦│العضو : {}
🇸🇦│تم حظره في المجموعات"""
Dbanall = """🇸🇦│العضو : {}
🇸🇦│بالفعل محظور بالمجموعات"""

unban = """🇸🇦│العضو : {}
🇸🇦│تم الغاء حظره من المجموعة"""
Dunban = """🇸🇦│العضو : {}
🇸🇦│بالفعل غير محظور من المجموعة"""

unbanall = """🇸🇦│العضو : {}
🇸🇦│تم الغاء حظره في المجموعات"""
Dunbanall = """🇸🇦│العضو : {}
🇸🇦│بالفعل غير محظور بالمجموعات"""

restricted = """🇸🇦│العضو : {}
🇸🇦│تم تقييد من المجموعة"""
Drestricted = """🇸🇦│العضو : {}
🇸🇦│بالفعل مقيد من المجموعة"""

unrestricted = """🇸🇦│العضو : {}
🇸🇦│تم الغاء تقييد من المجموعة"""
Dunrestricted = """🇸🇦│العضو : {}
🇸🇦│بالفعل غير مقيد من المجموعة"""

restrictedall = """🇸🇦│العضو : {}
🇸🇦│تم تقييد في المجموعات"""
Drestrictedall = """🇸🇦│العضو : {}
🇸🇦│بالفعل مقيد بالمجموعات"""

unrestrictedall = """🇸🇦│العضو : {}
🇸🇦│تم الغاء تقييد في المجموعات"""
Dunrestrictedall = """🇸🇦│العضو : {}
🇸🇦│بالفعل غير مقيد بالمجموعات"""

haveRank = "🇸🇦│لا يمكنك (حظر | طرد | كتم | تقييد) الـ{}"
haveKick = "🇸🇦│عذراً العضو مطرود او غير موجود بالمجموعة"
delList = "🇸🇦│مسح {}"

TKflood = """🇸🇦│العضو : {}
🇸🇦│تم تقييده لتجاوز عدد الرسائل المحدده {} في الوقت المحدد {}"""

DoneSet = "🇸🇦│تم وضع {} {}"


haveRc = """🇸🇦│العضو : {}
🇸🇦│بالفعل مقيد"""

showlist = "🇸🇦│قائمة {} :\n{}"
listempty = "🇸🇦│قائمة {} فارغة"
creatorempty = "🇸🇦│عذراً لا يوجد منشئ"
listempty2 = "🇸🇦│القائمة فارغة"
Doneblock = "🇸🇦│تم منع ({}) في المجموعة ({})"
Adoneblock = "🇸🇦│({}) بالفعل ممنوعة في المجموعة"


StB = "🇸🇦│تم منع الملصق في المجموعة ({})"
StA = "🇸🇦│الملصق بالفعل ممنوع في المجموعة ({})"

GfB = "🇸🇦│تم منع المتحركة في المجموعة ({})"
GfA = "🇸🇦│المتحركة بالفعل ممنوعة في المجموعة ({})"

PhB = "🇸🇦│تم منع الصورة في المجموعة ({})"
PhA = "🇸🇦│الصورة بالفعل ممنوعة في المجموعة ({})"


unDoneblock = "🇸🇦│تم الغاء منع ({}) في المجموعة ({})"
unAdoneblock = "🇸🇦│({}) بالفعل غير ممنوعة في المجموعة"

unStB = "🇸🇦│تم الغاء منع الملصق في المجموعة ({})"
unStA = "🇸🇦│الملصق بالفعل غير ممنوع في المجموعة ({})"

unGfB = "🇸🇦│تم الغاء منع المتحركة في المجموعة ({})"
unGfA = "🇸🇦│المتحركة بالفعل غير ممنوعة في المجموعة ({})"

unPhB = "🇸🇦│تم الغاء منع الصورة في المجموعة ({})"
unPhA = "🇸🇦│الصورة بالفعل غير ممنوعة في المجموعة ({})"
blocklist = "🇸🇦│{} قوائم الخاصة بالمجموعة {}"
banlist = "🇸🇦│قوائم العام الخاصة بالبوت"


blocklist2 = "المنع"
replylist = "الردود"
replylistBot = "ردود البوت"
BlocklistRm = "مسح الكلمات الممنوعة"
replylistRm = "مسح ردود الكلمات"
STreplylistRm = "مسح ردود الملصقات"
VOreplylistRm = "مسح ردود الصوتيات"
GFreplylistRm = "مسح ردود المتحركات"

BlocklistEm = "🇸🇦│قائمة الكلمات الممنوعة فارغة"
replylistEm = "🇸🇦│قائمة الكلمات فارغة"
STreplylistEm = "🇸🇦│قائمة الملصقات فارغة"
GFreplylistEm = "🇸🇦│قائمة المتحركات فارغة"
VOreplylistEm = "🇸🇦│قائمة الصوتيات فارغة"

Blocklistone = "الغاء منع"
Delall = "🇸🇦│يمكنك مسح القائمة بالضغط على ▽"
Delall2 = "الغاء منع الكل"
DoneUNblock = "تم الغاء المنع"

DelallR = "🇸🇦│يمكنك مسح الردود بالضغط على ▽"
Delall2R= "مسح الكل"

Donewel = "🇸🇦│تم تغير الترحيب الى {}"

Sendreply = """🇸🇦│الان ارسل الرد الذي تريد وضعة لـ %s
يمكنك استخدام الـhtml ويمكنك ايضا :

<b>{fn}</b> : لعرض الاسم
<b>{username}</b> : لعرض المعرف
<b>{id}</b> : لعرض الايدي
<b>{stast}</b> : لعرض الموقع
<b>{cn}</b> : لعرض اسم المجموعة"""

SRtext = "🇸🇦│تم حفظ الرد الخاص بـ({})"
SRst = "🇸🇦│تم حفظ الملصق الخاص بـ({})"
SRgf = "🇸🇦│تم حفظ المتحركة الخاصة بـ({})"
SRvo = "🇸🇦│تم حفظ البصمه الخاصة بـ({})"

Drp = "🇸🇦│تم حذف الرد الخاص بـ({})"
Norp = "🇸🇦│لا يوجد رد خاص بـ({})"
Yrp = "🇸🇦│عذراً يوجد رد خاص بـ({})"
allbandel = "مسح المحظورين عام"

alltkdel = "مسح المكتومين عام"

allbanE = "🇸🇦│قائمة المحظورين عام فارغة"

alltkE = "🇸🇦│قائمة المكتومين عام فارغة"

Ddelbanall = "🇸🇦│تم حذف قائمة المحظورين عام"

Ddeltkall = "🇸🇦│تم حذف قائمة المكتومين عام"

Dsetname = "🇸🇦│تم تغير اسم المجموعة الى {}"
Dsetabout = "🇸🇦│تم تغير وصف المجموعة الى {}"

Dsetphoto = "🇸🇦│تم تغير صورة المجموعة"
Dsetlk = """🇸🇦│تم تغير رابط المجموعة الى :
{}"""
yourmsgs = "🇸🇦│رسائلك (<b>{}</b>)"
youredits = "🇸🇦│تعديلاتك (<b>{}</b>)"

youraddcontact = """🇸🇦│جهاتك (<b>{}</b>)
🇸🇦│تم حذف عدد جهاتك"""

yes = "نعم"
no = "لا"
kickme = "<b>هل انت متاكد؟</b>"
Dkickme = "🇸🇦│تم طردك بأرادتك"
Nkickme = "🇸🇦│تم الغاء الامر"

Rsudo = "مطور اساسي"
Rasudo = "مطور اساسي ثانوي"
Rsudos = "مطور"
Rmalk = "مالك القروب"
Racreator = "منشئ اساسي القروب"
Rmalk = "مالك"
Rcreator = "منشئ اساسي"
Rcreator = "منشئ القروب"
Rowner = "مدير القروب"
Radmin = "ادمن"
Rvip = "عضو مميز"
Rmember = "عضو"

Rrank = "رتبتك : {}"
Rmsgs = "رسائلك : ({})"
Rrate = "تفاعلك : ({})"
Redits = "تعديلاتك : ({})"
RID = "ايديك : {}"
RIDPH = "اسمك : {}\n ايديك : {}"
RIDPHs = "🇸🇦│اضغط لأظهار معلوماتك"
DPROadmins = "🇸🇦│تم رفع ادامن المجموعة في البوت"
DsetSudosShow = "🇸🇦│تم تغير رسالة المطور"

DsetSudosShowE = "🇸🇦│عذراً توجد مشكلة في html الرسالة"



sendto = "🇸🇦│اين تريد ارسالةا؟"

Dpinmsg = "🇸🇦│تم تثبيت الرسالة"
Dunpinmsg = "🇸🇦│تم الغاء تثبيت الرسالة"

showstats = """🇸🇦│احصائيات البوت :

🇸🇦│عدد المجموعات : <b>{}</b>
🇸🇦│عدد المحادثات : <b>{}</b>"""

showGPlk = "🇸🇦│رابط المجموعة : \n {}"

PRsendtoGP = "🇸🇦│يتم الان ارسال الرسالة الى المجموعات"

PRsendtoPR = "🇸🇦│يتم الان ارسال الرسالة الى المحادثات"

DsendtoGP = """🇸🇦│تم ارسال الرسالة الى المجموعات
🇸🇦│تم ارسالةا الى : <b>{}</b>
🇸🇦│لم يتم ارسالةا الى : <b>{}</b>"""
DsendtoPR = """🇸🇦│تم ارسال الرسالة الى المحادثات
🇸🇦│تم ارسالةا الى : <b>{}</b>
🇸🇦│لم يتم ارسالةا الى : <b>{}</b>"""


clickTOpv = "🇸🇦│عرض بالمحادثة"
 
Toolong = "🇸🇦│عذراً الرسالة طويلة اضغظ على الزر لعرضها في محادثه البوت"

DoneDelList = "🇸🇦│تم مسح القائمة"
SetAuto = "🇸🇦│تم وضع عدد التفعيل التلقائي  (<b>{}</b>)"

NoMember = "🇸🇦│عذراً العضو غير موجود بالمجموعة"

cTsudo = "🇸🇦│لا يمكنك (حظر عام/كتم عام) مطور"

Toolow = "🇸🇦│عذراً عدد القروب اقل من (<b>{}</b>)"

GiveMEall = "🇸🇦│عذرا لايمكنني تفعيل المجموعة رجاءا امنحني كل خواص الادمن"

DoneleaveChat = "🇸🇦│تم المغادره من المجموعة"


banclick = """🇸🇦│العضو : {}
🇸🇦│تم حظرك من استخدام الازرار لمدة دقيقتين بسبب تكرارك"""

NoDeleted =  "🇸🇦│عذراً لا يوجد حسابات محذوفه في المجموعة"
LenDeleted = "🇸🇦│يوجد {} حساب محذوف سيتم طردهم من المجموعة"


AdminO = """🇸🇦│اوامر الادامن ↫ ⤈
━───━ 🇸🇦 ━───━
🇸🇦│الاعدادت
🇸🇦│كشف القيود
🇸🇦│مسح + بالرد
━───━ 🇸🇦 ━───━
🇸🇦│طرد ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│حظر ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│كتم ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│تقييد ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│الغاء طرد ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│الغاء حظر ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│الغاء كتم ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│الغاء تقييد ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│المكتومين ◍ مسح المكتومين
🇸🇦│المقيدين ◍ مسح المقيدين
🇸🇦│المحظورين ◍ مسح المحظورين
🇸🇦│المطرودين ◍ مسح المطرودين
━───━ 🇸🇦 ━───━
🇸🇦│تفعيل ◍ تعطيل ↫ الالعاب"""

OwnerO = """🇸🇦│اوامر المدراء ↫ ⤈
━───━ 🇸🇦 ━───━
🇸🇦│قائمه الردود
🇸🇦│قائمه المنع
🇸🇦│اضف ◍ حذف ↫ رد + الرد
🇸🇦│اضف ◍ حذف ↫ امر + الامر الجديد
🇸🇦│منع ↫ بالرد على ( ملصق ◍ صورة ◍ متحركة )
🇸🇦│الغاء منع ↫ بالرد على ( ملصق ◍ صورة ◍ متحركة )
🇸🇦│منع ◍ الغاء منع + الكلمه
━───━ 🇸🇦 ━───━ 
🇸🇦│وضع ترحيب + الترحيب
🇸🇦│وضع اسم + الاسم
🇸🇦│وضع وصف + الوصف
🇸🇦│وضع رابط + رابط
🇸🇦│وضع صورة↫بالرد على الصورة
🇸🇦│وضع التكرار
🇸🇦│وضع التحقق
━───━ 🇸🇦 ━───━
🇸🇦│تنزيل الكل ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│رفع ◍ تنزيل↫ادمن ⤈
🇸🇦│( بالرد ◍ بالمعرف ◍ بالايدي )
🇸🇦│رفع ◍ تنزيل↫مميز ⤈
🇸🇦│( بالرد ◍ بالمعرف ◍ بالايدي )
🇸🇦│الادامن ◍ مسح الادامن
🇸🇦│المميزين ◍ مسح المميزين
━───━ 🇸🇦 ━───━
🇸🇦│تنظيف + العدد
🇸🇦│تثبيت
🇸🇦│وقت ◍ عدد↫التكرار + التكرار
🇸🇦│تعين الايدي + رسالة الايدي
🇸🇦│مسح الايدي ↫ لحذف الرسالة
━───━ 🇸🇦 ━───━
🇸🇦│تفعيل ◍ تعطيل + الامر ↫ ⤈
🇸🇦│الايدي ◍ الايدي بالصورة ◍ الايدي بالازرار
🇸🇦│اطردني ◍ الترحيب ◍ التكرار
🇸🇦│الردود ◍ ردود البوت ◍ التحقق"""

CreatorO = """🇸🇦│ اوامر المنشئين ↫ ⤈
━───━ 🇸🇦 ━───━
🇸🇦│ تاك للكل
🇸🇦│ تفعيل ◍ تعطيل ↫ التثبيت
🇸🇦│ مسح↫المحذوفين ◍ البوتات
🇸🇦│ تنزيل الكل ↫ بالرد ◍ بالمعرف ◍ بالايدي
🇸🇦│ الاوامر المضافة
🇸🇦│ اضف رسائل ↫ بالرد
🇸🇦│رفع ◍ تنزيل↫مدير ⤈
🇸🇦│( بالرد ◍ بالمعرف ◍ بالايدي )
🇸🇦│ المدراء ◍ مسح المدراء
━───━ 🇸🇦 ━───━
🇸🇦│ اوامر المنشئين الاساسيين ↫ ⤈
━───━ 🇸🇦 ━───━
🇸🇦│ تفعيل ◍ تعطيل ↫ الطرد ◍ الحظر
🇸🇦│ رفع ◍ تنزيل ↫ منشئ
🇸🇦│ المنشئين ◍ مسح المنشئين
━───━ 🇸🇦 ━───━
🇸🇦│ اوامر المالكين ↫ ⤈
━───━ 🇸🇦 ━───━
🇸🇦│ ترتيب الاوامر
🇸🇦│ رفع ◍ تنزيل ↫ منشئ اساسي
🇸🇦│ مسح المنشئين الاساسين
🇸🇦│ المنشئين الاساسين"""

SudosO = """اوامر المطورين :

(تفعيل|تعطيل) المجموعة
(رفع|تنزيل) منشئ <معرف|بالرد|ايدي>

(اضف|حذف) للبوت <جملة>
قائمة ردود البوت
━───━ 🇸🇦 ━───━"""

SudoO = """اوامر المطور الاساسي :

(رفع|تنزيل) مطور <معرف|بالرد|ايدي>
(حظر|كتم) عام <معرف|بالرد|ايدي>
الغاء (حظر|كتم) العام <معرف|بالرد|ايدي>
(قوائم العام|المطورين>

(اذاعه|توجيه) <بالرد>
مغادرة <ايدي المجموعة>
(المجموعات|روابط المجموعات)

وضع امر المطور <رسالة>
(تفعيل|تعطيل) <التلقائي>
عدد التلقائي <عدد>

تحديث <البوت|اللغات>
(اضف|حذف) ملف
الملفات
━───━ 🇸🇦 ━───━"""

Showall = """اهلا بك في بوت <a href=\"t.me/yousef_labban1\">‹  yousefff</a>
يمكنك استخدام هذه الاوامر ▽"""

LockO = """🇸🇦│اوامر حماية المجموعة ↫ ⤈
━───━ 🇸🇦 ━───━
🇸🇦│قفل ◍ فتح ↫ الروابط
🇸🇦│قفل ◍ فتح ↫ المعرف
🇸🇦│قفل ◍ فتح ↫ البوتات
🇸🇦│قفل ◍ فتح ↫ المتحركة
🇸🇦│قفل ◍ فتح ↫ الملصقات
🇸🇦│قفل ◍ فتح ↫ الملفات
🇸🇦│قفل ◍ فتح ↫ الصور
🇸🇦│قفل ◍ فتح ↫ الفيديو
🇸🇦│قفل ◍ فتح ↫ الانلاين
🇸🇦│قفل ◍ فتح ↫ الدردشة
🇸🇦│قفل ◍ فتح ↫ التوجيه
🇸🇦│قفل ◍ فتح ↫ الاغاني
🇸🇦│قفل ◍ فتح ↫ الصوت
🇸🇦│قفل ◍ فتح ↫ الجهات
🇸🇦│قفل ◍ فتح ↫ الماركداون
🇸🇦│قفل ◍ فتح ↫ التاك
🇸🇦│قفل ◍ فتح ↫ التعديل
🇸🇦│قفل ◍ فتح ↫ الاشعارات
🇸🇦│قفل ◍ فتح ↫ المنشورات
🇸🇦│قفل ◍ فتح ↫ الدخول
🇸🇦│قفل ◍ فتح ↫ الملاحظة
🇸🇦│قفل ◍ فتح ↫ العربية
🇸🇦│قفل ◍ فتح ↫ الانجليزية
🇸🇦│قفل ◍ فتح ↫ الكل
━───━ 🇸🇦 ━───━
🇸🇦│انصح بأستخدام امر (الاعدادات) للسهوله"""

lockC = "◗اوامر الحماية◖"
AdminC = "◗اوامر الادامن◖"
OwnerC = "◗اوامر المدراء◖"
CreatorC = "◗اوامر المنشئين◖"
SudosC = "◗اوامر المطورين◖"
SudoC = "◗اوامر المطور الاساسي◖"


ShowGPN = "{}- الاسم : ({})\nالايدي : (`{}`)"

AsPh = '''💬 {}
📊 {}
📇 {}'''


Dulang = "🇸🇦│تم تحديث لغات البوت"

SudoOnle = "🇸🇦│عذراً الامر للمطور الاساسي"

Chlang = """🇮🇶꒐ اختر اللغه
🇺🇸꒐ Choose the language"""


lang ={"ar":"🇮🇶 AR-Classic","en":"🇺🇸EN","arem":"🇮🇶 AR-Emoji"}


IDnPT = '''🇸🇦│ايديك : {id}
🇸🇦│يوزرك : {username}
🇸🇦│موقعك : {stast}
🇸🇦│رسائلك : {msgs}
🇸🇦│تعديلاتك : {edits}
🇸🇦│تفاعلك : {rate}
━───━ 🇸🇦 ━───━'''


DsetIDShow = "🇸🇦│تم تغير رسالة الايدي"
Ddelid = "🇸🇦│تم مسح رسالة الايدي سيتم عرض الاساسية"

NoBots= "🇸🇦│عذراً لا يوجد بوتات في المجموعة"
LenBots = "🇸🇦│يوجد {} بوت سيتم طردهم من المجموعة"

Wres = "🇸🇦│سيتم اعادة تشغيل البوت الرجاء الانتظار"


MoreInfo = "◖ᏕᎧᏬᖇᏨᏋ ᏰᎽ ᎯᏋƘᎧ◗"

CKgps = "فحص المجموعات"

Dckg = "\n🇸🇦│تم فحص المجموعات وتم حذف {}"

ckpr = "🇸🇦│يتم الان فحص المجموعات قد يستغرق القليل من الوقت"

true2 = "√"
false2 = "✘"

settingsRes = """🇸🇦│اعدادات التقييد بالمجموعة
🇸🇦│√←مفتوحه | ✘←مقفوله"""

pk = "◁"
fr = "▷"
hide = "◗اخفاء◖"

sors = "البوت [{}] من سورس [‹  yousefff](t.me/yousef_labban1)"

dellink = "◗رابط حذف حساب التليكرام◖"




botstart = """🇸🇦│اهلا بك في {} بوت حماية المجموعات
🇸🇦│يمكنك اضافتي <a href=\"http://t.me/{}?startgroup=botstart\">بالضغط هنا</a>
━───━ 🇸🇦 ━───━"""

Tban = "حظر"
Tres = "تقييد"

fset = "وضع التكرار : {}"
Tfset = "🇸🇦│يمكنك تغير وضع التكرار الى ( تقييد | حظر )"

NOaddfiles = "🇸🇦│عذراً لا توجد ملفات من <a href=\"http://t.me/yousef_labban1\">(‹  yousefff)</a>"

NOaddfiles2 = """🇸🇦│عذراً لاتوجد ملفات في البوت يمكنك اضافة ملفات عن طريق ارسال اضف ملف"""

addFiles = """🇸🇦│اليك الملفات المتوفره من <a href=\"http://t.me/yousef_labban1\">(‹  yousefff)</a>
🇸🇦│يمكنك تحميل الملف بالضغط علي اسم الملف"""

Dua = """🇸🇦│تم (تحميل/تحديث) الملف ({})
🇸🇦│يمكنك تفعيله عن طريق ارسال الملفات"""

Files = """🇸🇦│اليك الملفات الموجودة في البوت 
🇸🇦│يمكنك تفعيل وتعطيل الملف بالضغط"""

dlFiles = """🇸🇦│اليك الملفات الموجودة في البوت 
🇸🇦│يمكنك حذف الملف بالضغط"""


Delfile = "🇸🇦│تم حذف االملف ({})"
Delfiles = "🇸🇦│تم حذف جميع الملفات"

remall = """🇸🇦│العضو : {} 
🇸🇦│تم تنزيله من ({})"""

remallN = """🇸🇦│العضو : {} 
🇸🇦│ليس لديه رتب"""


RKgp = "المجموعات"
RKgpl = "روابط المجموعات"
RKaf = "اضف ملف"
RKrf = "حذف ملف"
RKf = "الملفات"
RKub = "تحديث البوت"
RKul = "تحديث اللغات"
sudostart = """🇸🇦│أهلاً بك ، المطور الاساسي
🇸🇦│يمكنك استخدام الاوامر التي ظهرت لك"""


Lenbans= "🇸🇦│يوجد {} محظور سيتم الغاء حظرهم"
NobansC = "🇸🇦│عذراً لا يوجد محظورين في المجموعة"

Lenrks= "🇸🇦│يوجد {} مقيد سيتم الغاء تقييدهم"
NorksC = "🇸🇦│عذراً لا يوجد مقيدين في المجموعة"

addor = "🇸🇦│({}) اضافته الى ؟"
Daddor = "🇸🇦│تم اضافة ({}) الى ({})"
SRph = "🇸🇦│تم حفظ الصورة الخاصة بـ({})"
SRfi = "🇸🇦│تم حفظ الملف الخاصة بـ({})"

checkmem = """🇸🇦│عذراً {} يجب علينا التأكد أنك لست روبوت
🇸🇦│اضغط نعم لأكمال التحقق
━───━ 🇸🇦 ━───━"""
checkmem2 = """🇸🇦│عذراً {} يجب علينا التأكد أنك لست روبوت
🇸🇦│اختر الاجابة الصحيحة لحل المعادلة
{}
━───━ 🇸🇦 ━───━"""
certain = "متأكد"
notcertain = "لست متأكد"
ucertain = "🇸🇦│هل انت متأكد؟"
bancheck = """🇸🇦│تم حظر {}، فشل بالتحقق"""

age = {"older_than":"أقدم من","newer_than":"أحدث من","aprox":"~"}


tset = "وضع التحقق : {}"
Ttset = "🇸🇦│يمكنك تغير وضع التحقق الى ( معادلات | خطوتين )"
Teq = "◗معادلات◖"
Ttwo = "◗خطوتين◖"

ReIDnPT = """🇸🇦│الايدي : {ReID}
🇸🇦│اليوزر : {Reus}
🇸🇦│الموقع : {Rerank}
🇸🇦│الرسائل : ({Remsgs})
🇸🇦│التعديلات : ({Reedits})
🇸🇦│التفاعل : ({Rerate})
🇸🇦│الانشاء : {Rage}
━───━ 🇸🇦 ━───━"""

IDnPT = '''🇸🇦│ايديك : {id}
🇸🇦│يوزرك : {username}
🇸🇦│موقعك : {stast}
🇸🇦│رسائلك : {msgs}
🇸🇦│تعديلاتك : {edits}
🇸🇦│تفاعلك : {rate}
🇸🇦│الانشاء : {age}
━───━ 🇸🇦 ━───━'''

Rage = "الانشاء : {}"

prGPadmin = """🇸🇦│العضو : {} 
🇸🇦│تم رفعه ادمن في المجموعة"""

gpinfo = """اسم المجموعة 🇸🇦│{}
عدد الاعضاء 🇸🇦│{}
عدد الادامن 🇸🇦│{}
عدد المطرودين 🇸🇦│{}
عدد المحظورين 🇸🇦│{}
عدد رسائل القروب 🇸🇦│{}
━───━ 🇸🇦 ━───━"""
